<a href="https://colab.research.google.com/github/Vamshika0302/Machine-Learning-lab/blob/main/18WH1AO574_Program2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [5]:
#!pip install db-sqlite3
import sqlite3

In [6]:
conn=sqlite3.connect('LabProgram2.db')
cur=conn.cursor()
conn=sqlite3.connect('test.db')
print("Opened database successfully");

Opened database successfully

In [7]:
conn.execute('''CREATE TABLE COMPANY
         (ID INT PRIMARY KEY     NOT NULL,
         NAME           TEXT    NOT NULL,
         AGE            INT     NOT NULL,
         ADDRESS        CHAR(50),
         SALARY         REAL);''')
print("Table created successfully");

Table created successfully

In [8]:
conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (1, 'Paul', 32, 'California', 20000.00)");
conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (2, 'Alien', 25, 'Texas', 15000.00)");
conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (3, 'Teddy', 23, 'Norway', 20000.00)");
conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (4, 'Mark', 25, 'Rich-Mond', 65000.00)");

conn.commit()
print ("Records created successfully");

Records created successfully

In [9]:
for row in conn.execute('select * from COMPANY'):
        print(row)

(1, 'Paul', 32, 'California', 20000.0)
(2, 'Alien', 25, 'Texas', 15000.0)
(3, 'Teddy', 23, 'Norway', 20000.0)
(4, 'Mark', 25, 'Rich-Mond', 65000.0)

In [10]:
conn.commit()

In [11]:
conn.close()